In [2]:
import os
import numpy as np
import pandas as pd

In [3]:
# 設定 data_path
dir_data = './data/'

#### 讀取資料

In [4]:
f_app = os.path.join(dir_data, 'application_train.csv')
print('Path of read in data: %s' % (f_app))
df = pd.read_csv(f_app)

Path of read in data: ./data/application_train.csv

#### 資料的 row 數以及 column 數

In [40]:
print("row數:{}".format(len(df)))
print("column數:{}".format(len(list(df.columns))))

row數:307511
column數:122

#### 資料的資訊

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Columns: 122 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(41), object(16)
memory usage: 286.2+ MB

#### 列出所有欄位

In [55]:
df.columns

Index(['SK_ID_CURR', 'TARGET', 'NAME_CONTRACT_TYPE', 'CODE_GENDER',
       'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL',
       'AMT_CREDIT', 'AMT_ANNUITY',
       ...
       'FLAG_DOCUMENT_18', 'FLAG_DOCUMENT_19', 'FLAG_DOCUMENT_20',
       'FLAG_DOCUMENT_21', 'AMT_REQ_CREDIT_BUREAU_HOUR',
       'AMT_REQ_CREDIT_BUREAU_DAY', 'AMT_REQ_CREDIT_BUREAU_WEEK',
       'AMT_REQ_CREDIT_BUREAU_MON', 'AMT_REQ_CREDIT_BUREAU_QRT',
       'AMT_REQ_CREDIT_BUREAU_YEAR'],
      dtype='object', length=122)

#### 截取部分資料(頭)

In [48]:
df2 = df[['SK_ID_CURR','TARGET','NAME_CONTRACT_TYPE','CODE_GENDER','FLAG_OWN_CAR']]
df2.head()

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
0      100002       1         Cash loans           M            N
1      100003       0         Cash loans           F            N
2      100004       0    Revolving loans           M            Y
3      100006       0         Cash loans           F            N
4      100007       0         Cash loans           M            N

#### 擷取部分資料(尾)

In [49]:
df2.tail()

        SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
307506      456251       0         Cash loans           M            N
307507      456252       0         Cash loans           F            N
307508      456253       0         Cash loans           F            N
307509      456254       1         Cash loans           F            N
307510      456255       0         Cash loans           F            N

#### 資料選擇

In [43]:
df2[df2.columns[0:3]][0:8]

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE
0      100002       1         Cash loans
1      100003       0         Cash loans
2      100004       0    Revolving loans
3      100006       0         Cash loans
4      100007       0         Cash loans
5      100008       0         Cash loans
6      100009       0         Cash loans
7      100010       0         Cash loans

#### 資料新增

In [44]:
df2.insert(0,column='Insert_Test',value = '0')
df2['Insert_Test'][0:5]

0    0
1    0
2    0
3    0
4    0
Name: Insert_Test, dtype: object

#### 資料更新

In [45]:
df2.loc[2:4,'Insert_Test'] = [2,2,2]
df2['Insert_Test'][0:5]

0    0
1    0
2    2
3    2
4    2
Name: Insert_Test, dtype: object

#### 刪除欄位

In [46]:
df2 = df2.drop(['Insert_Test'],axis=1)
df2.head()

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
0      100002       1         Cash loans           M            N
1      100003       0         Cash loans           F            N
2      100004       0    Revolving loans           M            Y
3      100006       0         Cash loans           F            N
4      100007       0         Cash loans           M            N

#### 資料過濾

In [37]:
fil = (df2['NAME_CONTRACT_TYPE'] == 'Cash loans')
df2[fil].head()

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
0      100002       1         Cash loans           M            N
1      100003       0         Cash loans           F            N
3      100006       0         Cash loans           F            N
4      100007       0         Cash loans           M            N
5      100008       0         Cash loans           M            N

#### 資料清理

In [50]:
df2 = df2.dropna() #刪除NAN資料

#### 資料排序

In [51]:
df2.sort_values("CODE_GENDER",ascending=False).head()

        SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
35657       141289       0    Revolving loans         XNA            Y
83382       196708       0    Revolving loans         XNA            N
38566       144669       0    Revolving loans         XNA            N
189640      319880       0    Revolving loans         XNA            Y
237209      374751       0         Cash loans           M            N